<?xml version="1.0" ?>
<net name="saved_model" version="10">
	<layers>
		<layer id="0" name="input_1" type="Parameter" version="opset1">
			<data element_type="f32" shape="1,3,299,299"/>
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>299</dim>
					<dim>299</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="StatefulPartitionedCall/functional_1/batch_normalization/FusedBatchNormV3/mean/Fused_Mul_4663346635_const" type="Const" version="opset1">
			<data element_type="f32" offset="0" shape="32,3,3,3" size="3456"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="StatefulPartitionedCall/functional_1/conv2d/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>3</dim>
					<dim>299</dim>
					<dim>299</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="data_add_42729/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="3456" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="StatefulPartitionedCall/functional_1/batch_normalization/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="StatefulPartitionedCall/functional_1/activation/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="StatefulPartitionedCall/functional_1/batch_normalization_1/FusedBatchNormV3/mean/Fused_Mul_4663746639_const" type="Const" version="opset1">
			<data element_type="f32" offset="3584" shape="32,32,3,3" size="36864"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="StatefulPartitionedCall/functional_1/conv2d_1/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>149</dim>
					<dim>149</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="data_add_4273242737/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="40448" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="StatefulPartitionedCall/functional_1/batch_normalization_1/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="StatefulPartitionedCall/functional_1/activation_1/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="StatefulPartitionedCall/functional_1/batch_normalization_2/FusedBatchNormV3/mean/Fused_Mul_4664146643_const" type="Const" version="opset1">
			<data element_type="f32" offset="40576" shape="64,32,3,3" size="73728"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="StatefulPartitionedCall/functional_1/conv2d_2/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="data_add_4274042745/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="114304" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="StatefulPartitionedCall/functional_1/batch_normalization_2/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="StatefulPartitionedCall/functional_1/activation_2/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="StatefulPartitionedCall/functional_1/max_pooling2d/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="3,3" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>147</dim>
					<dim>147</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="StatefulPartitionedCall/functional_1/batch_normalization_3/FusedBatchNormV3/mean/Fused_Mul_4664546647_const" type="Const" version="opset1">
			<data element_type="f32" offset="114560" shape="80,64,1,1" size="20480"/>
			<output>
				<port id="1" precision="FP32">
					<dim>80</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="StatefulPartitionedCall/functional_1/conv2d_3/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
				<port id="1">
					<dim>80</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="data_add_4274842753/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="135040" shape="1,80,1,1" size="320"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="StatefulPartitionedCall/functional_1/batch_normalization_3/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>80</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="StatefulPartitionedCall/functional_1/activation_3/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="StatefulPartitionedCall/functional_1/batch_normalization_4/FusedBatchNormV3/mean/Fused_Mul_4664946651_const" type="Const" version="opset1">
			<data element_type="f32" offset="135360" shape="192,80,3,3" size="552960"/>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="StatefulPartitionedCall/functional_1/conv2d_4/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="valid" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>80</dim>
					<dim>73</dim>
					<dim>73</dim>
				</port>
				<port id="1">
					<dim>192</dim>
					<dim>80</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="data_add_4275642761/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="688320" shape="1,192,1,1" size="768"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="StatefulPartitionedCall/functional_1/batch_normalization_4/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="StatefulPartitionedCall/functional_1/activation_4/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="StatefulPartitionedCall/functional_1/max_pooling2d_1/MaxPool" type="MaxPool" version="opset1">
			<data auto_pad="valid" kernel="3,3" pads_begin="0,0" pads_end="0,0" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>71</dim>
					<dim>71</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="StatefulPartitionedCall/functional_1/batch_normalization_5/FusedBatchNormV3/mean/Fused_Mul_4667746679_const" type="Const" version="opset1">
			<data element_type="f32" offset="689088" shape="96,192,1,1" size="73728"/>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="StatefulPartitionedCall/functional_1/conv2d_5/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="data_add_4281242817/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="762816" shape="1,96,1,1" size="384"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="StatefulPartitionedCall/functional_1/batch_normalization_5/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="StatefulPartitionedCall/functional_1/activation_5/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="StatefulPartitionedCall/functional_1/batch_normalization_6/FusedBatchNormV3/mean/Fused_Mul_4666946671_const" type="Const" version="opset1">
			<data element_type="f32" offset="763200" shape="48,192,1,1" size="36864"/>
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="StatefulPartitionedCall/functional_1/conv2d_6/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>48</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="data_add_4279642801/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="800064" shape="1,48,1,1" size="192"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="StatefulPartitionedCall/functional_1/batch_normalization_6/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="StatefulPartitionedCall/functional_1/activation_6/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="StatefulPartitionedCall/functional_1/batch_normalization_7/FusedBatchNormV3/mean/Fused_Mul_4667346675_const" type="Const" version="opset1">
			<data element_type="f32" offset="800256" shape="64,48,5,5" size="307200"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="StatefulPartitionedCall/functional_1/conv2d_7/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>48</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="data_add_4280442809/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1107456" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="StatefulPartitionedCall/functional_1/batch_normalization_7/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="StatefulPartitionedCall/functional_1/activation_7/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="StatefulPartitionedCall/functional_1/batch_normalization_8/FusedBatchNormV3/mean/Fused_Mul_4665746659_const" type="Const" version="opset1">
			<data element_type="f32" offset="1107712" shape="64,192,1,1" size="49152"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="StatefulPartitionedCall/functional_1/conv2d_8/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="data_add_4277242777/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1156864" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="StatefulPartitionedCall/functional_1/batch_normalization_8/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="StatefulPartitionedCall/functional_1/activation_8/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="StatefulPartitionedCall/functional_1/batch_normalization_9/FusedBatchNormV3/mean/Fused_Mul_4666146663_const" type="Const" version="opset1">
			<data element_type="f32" offset="1157120" shape="96,64,3,3" size="221184"/>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="StatefulPartitionedCall/functional_1/conv2d_9/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="data_add_4278042785/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1378304" shape="1,96,1,1" size="384"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="StatefulPartitionedCall/functional_1/batch_normalization_9/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="StatefulPartitionedCall/functional_1/activation_9/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="StatefulPartitionedCall/functional_1/batch_normalization_10/FusedBatchNormV3/mean/Fused_Mul_4666546667_const" type="Const" version="opset1">
			<data element_type="f32" offset="1378688" shape="96,96,3,3" size="331776"/>
			<output>
				<port id="1" precision="FP32">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="StatefulPartitionedCall/functional_1/conv2d_10/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>96</dim>
					<dim>96</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="data_add_4278842793/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1710464" shape="1,96,1,1" size="384"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="StatefulPartitionedCall/functional_1/batch_normalization_10/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>96</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="StatefulPartitionedCall/functional_1/activation_10/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="StatefulPartitionedCall/functional_1/average_pooling2d/AvgPool" type="AvgPool" version="opset1">
			<data auto_pad="same_upper" exclude-pad="true" kernel="3,3" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="StatefulPartitionedCall/functional_1/batch_normalization_11/FusedBatchNormV3/mean/Fused_Mul_4665346655_const" type="Const" version="opset1">
			<data element_type="f32" offset="1710848" shape="64,192,1,1" size="49152"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="StatefulPartitionedCall/functional_1/conv2d_11/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>192</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="data_add_4276442769/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1760000" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="StatefulPartitionedCall/functional_1/batch_normalization_11/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="StatefulPartitionedCall/functional_1/activation_11/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="StatefulPartitionedCall/functional_1/mixed_5b/concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>96</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="4" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="StatefulPartitionedCall/functional_1/batch_normalization_12/FusedBatchNormV3/mean/Fused_Mul_4670146703_const" type="Const" version="opset1">
			<data element_type="f32" offset="1760256" shape="32,320,1,1" size="40960"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="StatefulPartitionedCall/functional_1/conv2d_12/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="data_add_4286042865/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1801216" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="StatefulPartitionedCall/functional_1/batch_normalization_12/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="StatefulPartitionedCall/functional_1/activation_12/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="StatefulPartitionedCall/functional_1/batch_normalization_13/FusedBatchNormV3/mean/Fused_Mul_4669346695_const" type="Const" version="opset1">
			<data element_type="f32" offset="1801344" shape="32,320,1,1" size="40960"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="StatefulPartitionedCall/functional_1/conv2d_13/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="data_add_4284442849/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1842304" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="StatefulPartitionedCall/functional_1/batch_normalization_13/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="StatefulPartitionedCall/functional_1/activation_13/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="StatefulPartitionedCall/functional_1/batch_normalization_14/FusedBatchNormV3/mean/Fused_Mul_4669746699_const" type="Const" version="opset1">
			<data element_type="f32" offset="1842432" shape="32,32,3,3" size="36864"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="StatefulPartitionedCall/functional_1/conv2d_14/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="data_add_4285242857/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1879296" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="StatefulPartitionedCall/functional_1/batch_normalization_14/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="StatefulPartitionedCall/functional_1/activation_14/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="StatefulPartitionedCall/functional_1/batch_normalization_15/FusedBatchNormV3/mean/Fused_Mul_4668146683_const" type="Const" version="opset1">
			<data element_type="f32" offset="1879424" shape="32,320,1,1" size="40960"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="StatefulPartitionedCall/functional_1/conv2d_15/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="data_add_4282042825/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1920384" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="StatefulPartitionedCall/functional_1/batch_normalization_15/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="StatefulPartitionedCall/functional_1/activation_15/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="StatefulPartitionedCall/functional_1/batch_normalization_16/FusedBatchNormV3/mean/Fused_Mul_4668546687_const" type="Const" version="opset1">
			<data element_type="f32" offset="1920512" shape="48,32,3,3" size="55296"/>
			<output>
				<port id="1" precision="FP32">
					<dim>48</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="StatefulPartitionedCall/functional_1/conv2d_16/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>48</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="data_add_4282842833/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="1975808" shape="1,48,1,1" size="192"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="StatefulPartitionedCall/functional_1/batch_normalization_16/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>48</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="StatefulPartitionedCall/functional_1/activation_16/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="StatefulPartitionedCall/functional_1/batch_normalization_17/FusedBatchNormV3/mean/Fused_Mul_4668946691_const" type="Const" version="opset1">
			<data element_type="f32" offset="1976000" shape="64,48,3,3" size="110592"/>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="StatefulPartitionedCall/functional_1/conv2d_17/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>48</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>64</dim>
					<dim>48</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="data_add_4283642841/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="2086592" shape="1,64,1,1" size="256"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="StatefulPartitionedCall/functional_1/batch_normalization_17/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="StatefulPartitionedCall/functional_1/activation_17/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="StatefulPartitionedCall/functional_1/block35_1_mixed/concat" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="2">
					<dim>1</dim>
					<dim>64</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="3" precision="FP32">
					<dim>1</dim>
					<dim>128</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="StatefulPartitionedCall/functional_1/block35_1/mul/Fused_Mul_4670546707_const" type="Const" version="opset1">
			<data element_type="f32" offset="2086848" shape="320,128,1,1" size="163840"/>
			<output>
				<port id="1" precision="FP32">
					<dim>320</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="StatefulPartitionedCall/functional_1/block35_1_conv/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>128</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>320</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="data_add_4286842873/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="2250688" shape="1,320,1,1" size="1280"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="StatefulPartitionedCall/functional_1/block35_1_conv/BiasAdd/Add/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="StatefulPartitionedCall/functional_1/block35_1/add" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>320</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="StatefulPartitionedCall/functional_1/block35_1_ac/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>320</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="StatefulPartitionedCall/functional_1/batch_normalization_18/FusedBatchNormV3/mean/Fused_Mul_4672946731_const" type="Const" version="opset1">
			<data element_type="f32" offset="2251968" shape="32,320,1,1" size="40960"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="StatefulPartitionedCall/functional_1/conv2d_18/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="data_add_4291642921/copy_const" type="Const" version="opset1">
			<data element_type="f32" offset="2292928" shape="1,32,1,1" size="128"/>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="StatefulPartitionedCall/functional_1/batch_normalization_18/FusedBatchNormV3/variance/Fused_Add_" type="Add" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="StatefulPartitionedCall/functional_1/activation_18/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="StatefulPartitionedCall/functional_1/batch_normalization_19/FusedBatchNormV3/mean/Fused_Mul_4672146723_const" type="Const" version="opset1">
			<data element_type="f32" offset="2293056" shape="32,320,1,1" size="40960"/>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="StatefulPartitionedCall/functional_1/conv2d_19/Conv2D" type="Convolution" version="opset1">
			<data auto_pad="same_upper" dilations="1,1" output_padding="0,0" pads_begin="0,0" pads_end="0,0" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>320</dim>
					<dim>35</dim>
					<dim>35</dim>
				</port>
				<port id="1">
					<dim>32</dim>
					<dim>320</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
